In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import time
from kafka_source.fakedata import create_fakeuser

In [6]:
mysql = create_engine(f"mysql+pymysql://hyunsoo:910506@localhost:3306/dataops?charset=utf8mb4")

cursor = mysql.connect()

pd.read_sql("SHOW DATABASES", mysql)

             Database
0             dataops
1  information_schema
2               mysql
3  performance_schema
4                 sys

In [3]:
postgres = create_engine(f"postgresql://yein:941021@localhost:5432/postgres")

pd.read_sql("SELECT * FROM pg_settings WHERE name = 'wal_level'", postgres)

,name,setting,unit,category,short_desc,extra_desc,context,vartype,source,min_val,max_val,enumvals,boot_val,reset_val,sourcefile,sourceline,pending_restart
0,wal_level,logical,None,Write-Ahead Log / Settings,Set the level of information written to the WAL.,None,postmaster,enum,configuration file,None,None,"[minimal, replica, logical]",replica,logical,/var/lib/postgresql/data/postgresql.conf,12,False

In [3]:
df = pd.DataFrame([create_fakeuser()])
df

,name,ssn,job,residence,blood_group,sex,birthdate,uuid
0,Jordan Lamb,501-10-5839,Medical illustrator,"9658 James Lights\nLake Theresaside, AL 53456",O-,F,19790430,N6Av2gotbLeUa4xNPKTqA4

In [6]:
for _ in range(10):

    pdf = pd.DataFrame([create_fakeuser()])
    pdf.to_sql(name="fakeuser", con=mysql, if_exists="append")
    print(pdf)
    time.sleep(2)

              name          ssn                          job  \
0  Kristen Jackson  685-52-0581  Conservator, museum/gallery

                                           residence blood_group sex  \
0  8679 Riley Spur Apt. 360\nPort Rachaelbury, NE...          O+   F

  birthdate                    uuid
0  19831015  YdBjA7PNBBkVbeBSLkUmS4
            name          ssn  job                             residence  \
0  Laura Fleming  059-76-2537  Sub  147 Nancy Lakes\nCarrieton, TN 69255

  blood_group sex birthdate                    uuid
0         AB-   F  19581110  mtpPmEmHiMLtxqqHJTwYsp
           name          ssn                 job  \
0  Anna Fischer  460-25-7857  Surveyor, minerals

                                     residence blood_group sex birthdate  \
0  1854 Shawn Throughway\nLake Jason, LA 75046          B-   F  19780922

                     uuid
0  5srWWb3aEtDcXratuKnxix
          name          ssn                  job  \
0  Andrew Ward  278-91-6940  Programmer, systems

                                          residence blood_group sex birthdate  \
0  681 Arroyo Spur Suite 395\nMorrismouth, WV 13029          O-   M  19870131

                     uuid
0  enGmnTEv9WbEk8cYm32LSo
            name          ssn                job  \
0  Nicole Mccall  575-73-0300  Fish farm manager

                                         residence blood_group sex birthdate  \
0  774 Lewis Burgs Apt. 999\nNew Deborah, MH 94479         AB-   F  19950210

                     uuid
0  YZnECuzBLPjBCDhDmEEnVU
           name          ssn                             job  \
0  Stephen Hart  683-52-8306  Chartered certified accountant

                                           residence blood_group sex  \
0  5578 Flores Rapids Apt. 827\nNorth William, WA...          B-   M

  birthdate                    uuid
0  19800309  LxepavSTKcukBa7MTNhuP8

KeyboardInterrupt:

In [10]:
cursor.execute(text("DELETE FROM dataops WHERE birthdate = '20000613'"))
cursor.commit()

In [11]:
cursor.execute(text("UPDATE dataops SET name = 'hyunsoo lee' WHERE birthdate = '19810916'"))
cursor.commit()

In [7]:
df = pd.read_csv("/home/ubuntu/workspace/Dagster/dataset/tips.csv")

df.to_sql(name="tips", con=mysql, if_exists="replace")

244

In [13]:
pd.read_sql("SELECT * FROM dataops.names", conn).head()

   index  id       name  year gender  count
0      0   1       Mary  1880      F   7065
1      1   2       Anna  1880      F   2604
2      2   3       Emma  1880      F   2003
3      3   4  Elizabeth  1880      F   1939
4      4   5     Minnie  1880      F   1746